const posts = [
  {
    url: 'https://medium.com/@prosazhin/как-не-надо-подчеркивать-ссылки-9a767bdcd32e',
    title: 'Как не надо подчеркивать ссылки',
    description:
      'Как-то нашел статью в блоге Макса Полетаева про альтернативный метод подчеркивания ссылок. Подумал — «Вот здорово, только писал про ссылки в записи про тему для Эгеи». Выглядело все очень круто, можно и пунктир, и точками сделать. Я попробовал этот метод в жизни, и вот что вышло.',
    create: '2017-03-29',
    tags: ['Design', 'Frontend'],
  },
  {
    url: 'https://medium.com/@prosazhin/чистота-адресной-строки-3a2d149cbfc',
    title: 'Чистота адресной строки',
    description:
      'В последнее время все больше удивляюсь разнице в мышлении программистов и дизайнеров. Я, конечно, не полноценный разработчик, но все таки что-то умею. Это позволяет понимать обе точки зрения и обращать внимание на мелочи, которые не каждый заметит. Сегодня хочу порассуждать про адресную строку, и какой вид url’а вообще приемлем для пользователя.',
    create: '2017-04-11',
    tags: ['Design', 'Frontend'],
  },
  {
    url: 'https://medium.com/@prosazhin/нестыдная-регистрация-c63797b29890',
    title: 'Нестыдная регистрация',
    description:
      'Один из известных и понятных нам шаблонов поведения пользователя — это регистрация и авторизация. Вопросов к тому, как это работает в 99% приложений и сервисов у нас не возникает, но это не значит, что эти шаблоны нельзя сделать лучше.',
    create: '2019-12-30',
    tags: ['Design'],
  },
  {
    url: 'https://medium.com/@prosazhin/ожидания-от-figma-70abd6c37465',
    title: 'Ожидания от Figma',
    description:
      'На этот текст меня вдохновила статья «Figma, Sketch и Adobe XD прикидываются тупыми». И я полностью согласен с автором статьи. Но понятно, что пока такие большие изменения дойдут до продактов Figma и пройдут через все круги скрама, пройдут годы. Если мы и увидим подобный, скорее утопичный, интерфейс то очень не скоро. А вот подумать над тем, что реально можно ожидать от разработчиков редактора в ближайшем будущем намного проще, тем более у меня есть свежие боли, которыми я хотел бы поделиться.',
    create: '2020-01-18',
    tags: ['Design', 'Figma'],
  },
  {
    url: 'https://medium.com/@prosazhin/надо-ли-делать-макет-если-можно-не-делать-1392dc73bf9a',
    title: 'Надо ли делать макет, если можно не делать',
    description:
      'Иногда появляются ситуации, когда появляется вопрос «Надо ли делать макет?». Бывают небольшие, простые и очевидные задачи, когда проще пойти и сделать сразу на фронте. Ответить на этот вопрос обычно не просто как себе, так и команде. Сейчас я попытаюсь дать ответ на все такие вопросы в будущем.',
    create: '2020-02-21',
    tags: ['Design', 'Development'],
  },
];

export default posts;
